package com.heisy.randommeditation

import androidx.lifecycle.ViewModel

class MainFragmentViewModel: ViewModel() {
    val kindsOfMeditation = listOf(
        Meditation("Дыхание",
            "Закрываем глаза и медленно дышим через нос, а выдыхаем через рот. Классический и супер эффективный способ медитации!"),
        Meditation("Музыка",
            "Включите любимую песню в режиме повторения и слушайте ее в течении заданного времени. Сосредоточьтесь по максимуму на музыке"),
        Meditation("Руки-Голова",
            "Закрываем глаза и сосредотачиваемся на трех точках: левая, правая рука и голова."),
        Meditation("А что происходит?",
            "Закрываем глаза, принимаем удобную позу и слушаем, что происходит вокруг. Даже если вы сидите в максимально тихой комнате, поверьте, эта комната не такая уж и тихая."),
        Meditation("Зеркало",
            "Садимся на против зеркала или передней камеры телефона и расматриваем себя любимого, Ни каких оценок, просто рассматриваем и стараемся не о чем не думать. Вам повезло, перед вами будет такой красавчик"),
        Meditation("Энергоком",
        "Принимаем удобную позу, закрываем глаза и катаем \"энергетический ком\" по телу. Старайтесь делать это неторопясь."),
        Meditation("Мантра",
        "Повторяем про себя мантру в течении всего времени это может быть: \"Я счастливый человек\",\"У меня все будет хорошо\",\"Я шарик летящих в облаках\" или тот, что для вас важно в сегодняшнем дне. Приступим?"),
        Meditation("Рассматриваем комнату вокруг",
        "Вокруг столько всего интересного, попробуйте рассматривать, что находиться вокруг вас, но никакой оценки. Вы удивитесь сколько разных маленьких деталей вы раньше не замечали. Ну что ж, приступим!"),
        Meditation("Стучим ритм (Молодой Бадди Рич)",
        "Садимся в удобную позу и начинаем настукивать ритм руками. Проявите своего внутренного барабанщик, сосредоточтесь на ритмичных ударах руками."),
        Meditation("Не думай не о чем",
        "Просто сидим и не о чем не думаем, не расстраивайтесь, если не получится с первого раза, это далеко не самый простой способ для медитации. Приступим?"),
        Meditation("Чашка кофе/ чая",
        "Пьем чай или кофе и максимально сосредотачиваемся на вкусе напитка. Постарайтесь делать это в течении всего времени."),
        Meditation("Хрумки",
        "Сосредотачиваемся на вкусе во время завтрака/обеда/ужина во время всего времени медитации. Если уже поели, возьмите полезный снек: яблоко, банан, орехи."),
        Meditation("Считаем барашков",
        "Закрываем глаза, визуализируем барашков и считаем их. Если есть проблемы с визуализацией, можете просто считать, но это не так весело."),
        Meditation("Сладкие булочки",
        "Садимся и сосредотачиваемся на своих ягодицах... Да, и такое тоже бывает. Have fun!"),
        Meditation("Крутим предмет в руке",
        "Берем ручки, мячик, четки и просто перекатываем в руках"),
        Meditation("Жвачка",
            "Берем жвачку и сосредотачиваемся на жевании в течении всего времени медитации"),
        Meditation("Медитация стоя",
        "стоим и дышим в течении всего времени медитации"),
        Meditation("Фото-эстет",
        "Рассматривайте любую вашу любимую фотографии из инстаргама или галлери, рассмотритет все детали, окунитесь в приятные воспоминания."),
        Meditation("Я люблю",
        "перечисляйте все что вы люите или кого в течении всего времени медитации, это может быть любимое блюдо, человек и т.д. Не важно, просто перечисляйте")
        )
    var attempt = 4
}